# CSC370 - All SQL notes

\+ Connect to SQL, CLI: `$ sudo mariadb -u root -p`  
\+ Notebook functionality comes from `ipython-sql` and `pymysql`

In [2]:
# Load the SQL extension
%load_ext sql

# Connect to a MariaDB database
%sql mysql+pymysql://root:1234321@localhost:3306/init

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Lec.2 - May 10

Ex: Create following:

| Name  | Age |    
|-------|-----|
| Alice | 22  |
| Bob   | 21  |

$\Leftrightarrow$

### 1. Creating database

In [18]:
%%sql
-- CREATE DATABASE T1;
USE T1;

 * mysql+pymysql://root:***@localhost:3306/class
0 rows affected.

[]

#### Deleting database:

In [19]:
%%sql
DROP DATABASE IF EXISTS init;

 * mysql+pymysql://root:***@localhost:3306/class
0 rows affected.

[]

In [20]:
%%sql
SHOW databases;

 * mysql+pymysql://root:***@localhost:3306/class
5 rows affected.

[('T1',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

### 2. Creating a table

In [ ]:
%%sql
CREATE TABLE `Student`(`name` VARCHAR(64),
                `age` INT
);

 * mysql+pymysql://root:***@localhost:3306/class
(pymysql.err.OperationalError) (1050, "Table 'Student' already exists")
[SQL: CREATE TABLE `Student`(`name` VARCHAR(64),
                `age` INT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#### Check table existance

In [21]:
%%sql
SHOW tables;

 * mysql+pymysql://root:***@localhost:3306/class
1 rows affected.

[('Student',)]

#### Showing table & info

In [22]:
%%sql
SELECT * FROM Student;

 * mysql+pymysql://root:***@localhost:3306/class
0 rows affected.

[]

In [23]:
%%sql
DESCRIBE Student;

 * mysql+pymysql://root:***@localhost:3306/class
2 rows affected.

[('name', 'varchar(64)', 'YES', '', None, ''),
 ('age', 'int(11)', 'YES', '', None, '')]

### 3. Inserting data

In [24]:
%%sql
insert into Student values('Alice', 22);
SELECT * FROM Student;

 * mysql+pymysql://root:***@localhost:3306/class
1 rows affected.
1 rows affected.

[('Alice', 22)]

#### Deleting data

In [15]:
%%sql
DELETE FROM Student
WHERE Name = 'Alice';

 * mysql+pymysql://root:***@localhost:3306/class
1 rows affected.

[]